---------------------------------------1-----------------------------------------
--Loans_type
--Loans

SELECT Loan_type.Название_вида_кредита, MAX(Loans.Сумма) AS [Максимальная сумма], MIN(Loans.Сумма) AS [Минимальная сумма], 
	   AVG(Loans.Сумма) AS [Средняя цена], COUNT(Loans.id) AS [Кол-во кредитов данного вида]
FROM Loans
	INNER JOIN Loan_type ON Loan_type.id = Loans.Код_вида
GROUP BY Loan_type.Название_вида_кредита
---------------------------------------------------------------------------------

---------------------------------------3-----------------------------------------

SELECT *
FROM (SELECT CASE
				WHEN Loans.Сумма between 1000 and 3000 then '1000-3000'
				ELSE 'Другая цена'
			 END [ПРЕДЕЛЫ ЦЕН], COUNT(*) as [Кол-во]
	  FROM Loans GROUP BY CASE
							  WHEN Loans.Сумма between 1000 and 3000 THEN '1000-3000'
							  ELSE 'Другая цена'
						   END) as T

---------------------------------------------------------------------------------

---------------------------------------4-----------------------------------------

SELECT Loan_type.Название_вида_кредита, ROUND(AVG(CAST(Loans.Сумма AS float(4))), 2)
FROM Loan_type
	JOIN Loans ON Loans.Код_вида = Loan_type.id
GROUP BY Loan_type.Название_вида_кредита
	

---------------------------------------------------------------------------------


---------------------------------------5-----------------------------------------

SELECT Loan_type.Название_вида_кредита, ROUND(AVG(CAST(Loans.Сумма AS float(4))), 2)
FROM Loan_type
	JOIN Loans ON Loans.Код_вида = Loan_type.id
WHERE Loan_type.Название_вида_кредита in ('Быстрый', 'Долгий')
GROUP BY Loan_type.Название_вида_кредита
	
---------------------------------------------------------------------------------

---------------------------------------6-----------------------------------------

SELECT Clients.Название_фирмы, ROUND(AVG(CAST(Loans.Сумма AS float(4))), 2)
FROM Loan_type
	JOIN Loans ON Loans.Код_вида = Loan_type.id
	JOIN Clients ON Loans.Код_клиента = Clients.id
WHERE Clients.id = 3
GROUP BY Clients.Название_фирмы
	
---------------------------------------------------------------------------------

---------------------------------------7-----------------------------------------

SELECT Loans.Код_вида, Loans.Сумма,
	   (SELECT DISTINCT COUNT(*)
		FROM Loans AS L2
		WHERE Loans.Код_вида = L2.Код_вида AND Loans.Сумма = L2.Сумма) [Кол-во]
FROM Loans
GROUP BY Loans.Код_вида, Loans.Сумма
HAVING Loans.Сумма > 9999 AND Loans.Сумма < 50000

---------------------------------------------------------------------------------