-----------------------1-------------------------
CREATE VIEW [Типы_кредита] AS 
	 SELECT id [Код],
			  Название_вида_кредита [Тип_кредита],
			  Ставка [Ставка]
	   FROM Loan_type

SELECT *
FROM [Типы_кредита]
-------------------------------------------------

-----------------------2-------------------------

CREATE VIEW [Сколько_разных_видов_кредитов_взял_каждый_клиент] 
AS SELECT Loans.Код_клиента [Код_клиента], COUNT(Код_вида) [Кол-во]
	FROM Loans
		INNER JOIN Loan_type ON Loan_type.id = Loans.Код_вида
	GROUP BY Loans.Код_клиента

SELECT *
FROM Сколько_разных_видов_кредитов_взял_каждый_клиент

-------------------------------------------------

-----------------------3-------------------------
ALTER VIEW [Добавить_вид_кредита](id, Название_вида_кредита, Ставка)
	AS SELECT Loan_type.id [id],
			  Loan_type.Название_вида_кредита [Название_вида_кредита],
			  Loan_type.Ставка [Ставка]
	FROM Loan_type
	WHERE Loan_type.Ставка > 250;


SELECT *
FROM Добавить_вид_кредита

INSERT Добавить_вид_кредита VALUES('4', 'Средний', 500)
DELETE Добавить_вид_кредита WHERE id = '4'
-------------------------------------------------

-----------------------4-------------------------
ALTER VIEW [Добавить_вид_кредита](id, Название_вида_кредита, Ставка)
	AS SELECT Loan_type.id [id],
			  Loan_type.Название_вида_кредита [Название_вида_кредита],
			  Loan_type.Ставка [Ставка]
	FROM Loan_type
	WHERE Loan_type.Ставка > 250 WITH CHECK OPTION


SELECT *
FROM Добавить_вид_кредита

INSERT Добавить_вид_кредита VALUES('5', 'Средний', 249)
UPDATE Добавить_вид_кредита SET id = 5 WHERE Ставка = 255
DELETE Добавить_вид_кредита WHERE id = '5'
-------------------------------------------------

-----------------------5-------------------------
CREATE VIEW [Первые_клиенты]
	AS SELECT TOP(2) Clients.Название_фирмы [Название_фирмы], Clients.id [id]
	   FROM Clients
	   ORDER BY Название_фирмы

SELECT * FROM Первые_клиенты
-------------------------------------------------

-----------------------6-------------------------
CREATE VIEW [Сколько_разных_видов_кредитов_взял_каждый_клиент_2] WITH  SCHEMABINDING
AS SELECT Loans.Код_клиента [Код_клиента], COUNT(Loans.Код_вида) [Кол-во]
	FROM dbo.Loans
		INNER JOIN dbo.Loan_type ON Loan_type.id = Loans.Код_вида
	GROUP BY Loans.Код_клиента

SELECT * FROM Сколько_разных_видов_кредитов_взял_каждый_клиент_2
-------------------------------------------------