-------------------------------------1----------------------------------------
SELECT *
FROM Loans, Clients
WHERE Loans.Код_клиента = Clients.id and Loans.Код_вида in (SELECT Loan_type.id
						    FROM Loan_type)
------------------------------------------------------------------------------

-------------------------------------2----------------------------------------
SELECT *
FROM Loans 
INNER JOIN Clients ON Loans.Код_клиента = Clients.id
WHERE Loans.Код_вида in (SELECT Loan_type.id FROM Loan_type)
------------------------------------------------------------------------------

-------------------------------------3----------------------------------------
SELECT *
FROM Loans 
INNER JOIN Clients ON Loans.Код_клиента = Clients.id
INNER JOIN Loan_type ON Loans.Код_вида = Loan_type.id
------------------------------------------------------------------------------

-------------------------------------4----------------------------------------
SELECT Loans.Сумма, Loans.Код_вида
FROM Loans
WHERE Код_клиента = (SELECT TOP(1) Код_клиента
							FROM Loans Lloans 
							WHERE Loans.Код_вида = Lloans.Код_вида
							ORDER BY Сумма DESC)

------------------------------------------------------------------------------

-------------------------------------5----------------------------------------

SELECT Clients.id
FROM Clients
WHERE not exists (SELECT *
				  FROM Loans 
				  WHERE Loans.Код_клиента = Clients.id)

------------------------------------------------------------------------------

-------------------------------------6----------------------------------------
SELECT top 1
	(SELECT AVG(Loans.Сумма) 
	 FROM Loans
	 WHERE Loans.Код_вида = 1),
	(SELECT AVG(Loans.Сумма) 
	 FROM Loans
	 WHERE Loans.Код_вида = 2),
	 (SELECT AVG(Loans.Сумма) 
	 FROM Loans
	 WHERE Loans.Код_вида = 3)
FROM Loans
------------------------------------------------------------------------------

-------------------------------------7----------------------------------------
SELECT Loans.Сумма, Loans.Код_вида
FROM Loans
WHERE Loans.Сумма >= all(SELECT Loans.Сумма
						 FROM Loans 
						 WHERE Loans.Код_вида = 2)
------------------------------------------------------------------------------

-------------------------------------8----------------------------------------
SELECT Loans.Сумма, Loans.Код_вида
FROM Loans
WHERE Loans.Сумма <= any(SELECT Loans.Сумма
						 FROM Loans 
						 WHERE Loans.Код_вида = 2)
------------------------------------------------------------------------------